Revit 2027 API
ParameterTypeId.LayerElemTopConstraint Property
 "Top Constraint"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LayerElemTopConstraint { get; }
Public Shared ReadOnly Property LayerElemTopConstraint As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LayerElemTopConstraint {
	ForgeTypeId^ get ();
}
static member LayerElemTopConstraint : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace